CSI API ETABS v1
cPropFrameSDShape.GetConcreteL Method
 Retrieves property data for a concrete L shape in a section designer section
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetConcreteL(
	string Name,
	string ShapeName,
	ref string MatProp,
	ref string PropName,
	ref int Color,
	ref double XCenter,
	ref double YCenter,
	ref double H,
	ref double Bf,
	ref double Tf,
	ref double Tw,
	ref double Rotation,
	ref bool MirrorAbout2,
	ref bool MirrorAbout3
)
Function GetConcreteL (
	Name As String,
	ShapeName As String,
	ByRef MatProp As String,
	ByRef PropName As String,
	ByRef Color As Integer,
	ByRef XCenter As Double,
	ByRef YCenter As Double,
	ByRef H As Double,
	ByRef Bf As Double,
	ByRef Tf As Double,
	ByRef Tw As Double,
	ByRef Rotation As Double,
	ByRef MirrorAbout2 As Boolean,
	ByRef MirrorAbout3 As Boolean
) As Integer
Dim instance As cPropFrameSDShape
Dim Name As String
Dim ShapeName As String
Dim MatProp As String
Dim PropName As String
Dim Color As Integer
Dim XCenter As Double
Dim YCenter As Double
Dim H As Double
Dim Bf As Double
Dim Tf As Double
Dim Tw As Double
Dim Rotation As Double
Dim MirrorAbout2 As Boolean
Dim MirrorAbout3 As Boolean
Dim returnValue As Integer
returnValue = instance.GetConcreteL(Name,
	ShapeName, MatProp, PropName, Color,
	XCenter, YCenter, H, Bf, Tf, Tw, Rotation,
	MirrorAbout2, MirrorAbout3)
int GetConcreteL(
	String^ Name,
	String^ ShapeName,
	String^% MatProp,
	String^% PropName,
	int% Color,
	double% XCenter,
	double% YCenter,
	double% H,
	double% Bf,
	double% Tf,
	double% Tw,
	double% Rotation,
	bool% MirrorAbout2,
	bool% MirrorAbout3
)
abstract GetConcreteL :
        Name : string *
        ShapeName : string *
        MatProp : string byref *
        PropName : string byref *
        Color : int byref *
        XCenter : float byref *
        YCenter : float byref *
        H : float byref *
        Bf : float byref *
        Tf : float byref *
        Tw : float byref *
        Rotation : float byref *
        MirrorAbout2 : bool byref *
        MirrorAbout3 : bool byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame section property that is a section designer section
ShapeName
Type: System.String
 The name of an existing concrete L shape in the specified frame section property
MatProp
Type: System.String
 The name of the material property for the shape
PropName
Type: System.String
 This is a blank string or the name of a defined concrete L property that has been imported from a section property file. If it is the name of a defined concrete L property, the section dimensions are taken from that property
Color
Type: System.Int32
 The fill color assigned to the shape
XCenter
Type: System.Double
 The X-coordinate of the center of the shape in the section designer coordinate system. [L]
YCenter
Type: System.Double
 The Y-coordinate of the center of the shape in the section designer coordinate system. [L]
H
Type: System.Double
 The section depth. [L]
Bf
Type: System.Double
 The flange width. [L]
Tf
Type: System.Double
 The flange thickness. [L]
Tw
Type: System.Double
 The web thickness. [L]
Rotation
Type: System.Double
 The counter clockwise rotation of the shape from its default orientation. [deg]
MirrorAbout2
Type: System.Boolean
Indicates whether the section is mirrored about the local 2-axis.
MirrorAbout3
Type: System.Boolean
Indicates whether the section is mirrored about the local 3-axis.
Return Value
Type: Int32
 Returns zero if the property data is successfully retrieved; otherwise it returns a nonzero value
Remarks
See Also
Reference
cPropFrameSDShape Interface
ETABSv1 Namespace